
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # github_branch_protection.opentelemetry-java-examples-main[0m will be created
[0m  [32m+[0m[0m resource "github_branch_protection" "opentelemetry-java-examples-main" {
      [32m+[0m[0m allows_deletions                = false
      [32m+[0m[0m allows_force_pushes             = false
      [32m+[0m[0m enforce_admins                  = true
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m lock_branch                     = false
      [32m+[0m[0m pattern                         = "main"
      [32m+[0m[0m repository_id                   = (known after apply)
      [32m+[0m[0m require_conversation_resolution = false
      [32m+[0m[0m require_signed_commits          = false
      [32m+[0m[0m required_linear_history         = false

      [32m+[0m[0m required_pull_request_reviews {
          [32m+[0m[0m require_code_owner_reviews      = true
          [32m+[0m[0m require_last_push_approval      = false
          [32m+[0m[0m required_approving_review_count = 1
        }

      [32m+[0m[0m restrict_pushes {
          [32m+[0m[0m blocks_creations = true
        }
    }

[1m  # github_repository.opentelemetry-java-examples[0m will be created
[0m  [32m+[0m[0m resource "github_repository" "opentelemetry-java-examples" {
      [32m+[0m[0m allow_auto_merge            = false
      [32m+[0m[0m allow_merge_commit          = false
      [32m+[0m[0m allow_rebase_merge          = false
      [32m+[0m[0m allow_squash_merge          = true
      [32m+[0m[0m archived                    = false
      [32m+[0m[0m default_branch              = (known after apply)
      [32m+[0m[0m delete_branch_on_merge      = false
      [32m+[0m[0m etag                        = (known after apply)
      [32m+[0m[0m full_name                   = (known after apply)
      [32m+[0m[0m git_clone_url               = (known after apply)
      [32m+[0m[0m has_issues                  = true
      [32m+[0m[0m html_url                    = (known after apply)
      [32m+[0m[0m http_clone_url              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m merge_commit_message        = "PR_TITLE"
      [32m+[0m[0m merge_commit_title          = "MERGE_MESSAGE"
      [32m+[0m[0m name                        = "opentelemetry-java-examples"
      [32m+[0m[0m node_id                     = (known after apply)
      [32m+[0m[0m primary_language            = (known after apply)
      [32m+[0m[0m private                     = (known after apply)
      [32m+[0m[0m repo_id                     = (known after apply)
      [32m+[0m[0m squash_merge_commit_message = "COMMIT_MESSAGES"
      [32m+[0m[0m squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      [32m+[0m[0m ssh_clone_url               = (known after apply)
      [32m+[0m[0m svn_url                     = (known after apply)
      [32m+[0m[0m topics                      = (known after apply)
      [32m+[0m[0m visibility                  = "public"
      [32m+[0m[0m web_commit_signoff_required = false

      [32m+[0m[0m security_and_analysis (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
